Revit 2025 API
ParameterTypeId.RebarShapeEndtreatmentEndType Property
 "End Treatment At End"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public static ForgeTypeId RebarShapeEndtreatmentEndType { get; }
Public Shared ReadOnly Property RebarShapeEndtreatmentEndType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RebarShapeEndtreatmentEndType {
	ForgeTypeId^ get ();
}
static member RebarShapeEndtreatmentEndType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace